# Требования к проекту
## 1 Введение
Задачник на месяц, в котором можно ставить на числа, дни недели свои задачи, а так же редактировать данные задачи и графически это отображать.

## 2 Требования пользователя
### 2.1 Программные интерфейсы
Работа с Windows формами на языке программирования c++ ver. 19.

### 2.2 Интерфейс пользователя
Пользователь будет производить управление с помощью мыши и клавиатуры. С помощью мыши выбирать дни недели в которые надо будет вписать задачи. С помощью клавиатуры он будет вписывать данные задачи и редактировать их.

### 2.3 Характеристики пользователей
Для использования данного продукта, пользователю не требуется никаких дополнительных знаний.

### 2.4 Предположения и зависимости
В данном проекте можно попробовать сохранять файлы под свои расширением,чтобы не потерять важную информацию.

## 3 Системные требования
### 3.1 Функциональные требования
Создание задач в разные дни месяца.
Их редактирование.
Графическое отображение выполнения задачи.
